app/controllers/api/v1/trains_controller.rb

    def index
      trains = Train.all
---
SELECT "trains".* FROM "trains"

    def create
      @train = Train.new(train_params)
      if @train.save && @train.valid?
---
INSERT INTO "trains" ("destination", "newtime", "newtime24", "origin", "remarks_boarding", "scheduled", "scheduled24", "service", "trainno", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    def update
      if @train.nil?
        puts "Train not found"
        render json: { message: "Train not found", success: false }, status: 406
      end
      if @train.update(train_params) && @train.valid?
---
UPDATE "trains" SET "service" = $1, "updated_at" = $2 WHERE "trains"."id" = $3  [["service", "Washington Express"], ["updated_at", "2020-01-04 03:14:04.517372"], ["id", 88]]

    def destroy
      if @train.destroy
---
DELETE FROM "trains" WHERE "trains"."id" = $1  [["id", 23]]

    def find_train
      @train = Train.find_by(id: params[:id])
---
SELECT "trains".* FROM "trains" WHERE "trains"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]